misc/benchmark/client-socketio-artillery.yml
config:
  target: "http://localhost:3000/"
  phases:
    - duration: 20
      arrivalRate: 1
scenarios:
  - engine: "socketio"
    flow:
      - think: 1
      - emit:
          channel: "evaluate"
          data: { code: "[1,2,3].map(&:to_s)" }
          response:
            channel: "output"        
      - think: 1
      - emit:
          channel: "evaluate"
          data: { code: "[1,2,3].map(&:to_s)" }
          response:
            channel: "output"        
      - think: 1
      - emit:
          channel: "evaluate"
          data: { code: "[1,2,3].map(&:to_s)" }
          response:
            channel: "output"        
      - think: 1
      - emit:
          channel: "evaluate"
          data: { code: "[1,2,3].map(&:to_s)" }
          response:
            channel: "output"        
      - think: 1
      - emit:
          channel: "evaluate"
          data: { code: "[1,2,3].map(&:to_s)" }
          response:
            channel: "output"        
      - think: 1               
      # - loop:
      #   - emit:
      #       channel: "evaluate"
      #       data: { code: "[1,2,3].map(&:to_s)" }
      #       response:
      #         channel: "output"        
      #   - think: 1
      #   count: 100